{
    "talks": [
        {
            "lastname": "Gokhale",
            "firstname": "Chaitanya",
            "title": "On the origins and evolution of endosymbiosis",
            "abstract": "Endosymbiosis was a transformative event in the history of life, enabling the emergence of complex eukaryotic cells from simpler microbial ancestors. Despite its significance, we do not understand how free-living microbial partnerships transition into obligate, physically integrated symbioses. I will address that gap by synthesising insights from two recent theoretical studies. The first explores how metabolic syntrophy can lead to stable ectosymbiosis. Using an ecological model, we examine how a mutant host capable of binding symbionts on its surface can invade and persist, despite the metabolic cost of reduced active cell area. Our results identify conditions under which close physical contact is favoured and reveal how enhanced metabolic activity can facilitate the transition toward obligate partnerships. Building on this, the second study uses adaptive dynamics to track evolutionary trajectories of host-symbiont collectives, focusing on two key traits: mutual dependence and reproductive cohesion. We show that while mutual dependence evolves relatively easily, reproductive integration is more constrained by ecological factors such as carrying capacity and asymmetric growth rates. Notably, we find that asymmetries in evolutionary pace, captured by processes such as the Red King effect, can drive one-sided obligacy, reflecting patterns often seen in natural symbioses. Taken together, these studies reveal the ecological and evolutionary mechanisms that can drive the transition from cooperation to integration. Our work offers a theoretical framework for understanding one of life’s major transitions and opens avenues for future exploration of cellular complexity.",
            "day": "Thursday",
            "time": "17:00--17:30"
        },
        {
            "lastname": "Heinzel",
            "firstname": "Carola",
            "title": "Estimating the Growth Rate of a Birth-Death Process for Small Sample Sizes",
            "abstract": "The problem of estimating the growth rate of a birth and death processes based on the coalescence times of a sample of $n$ individuals has been considered by several authors ([1, 2, 3, 4]). This problem has applications, for example, to cancer research, when one is interested in determining the growth rate of a clone. Recently, Johnson et al. [1] proposed an analytical method for estimating the growth rate using the theory of internal branch lengths of coalescent point processes. Their method has comparable accuracy to more computationally intensive methods when the sample size $n$ is large. We use a similar approach to obtain an estimate of the growth rate that is not based on the assumption that $n$ is large. \n\n We prove that our proposed estimator has, even asymptotically, a lower variance than the estimator proposed in [1] and that it is asymptotically unbiased. Additionally, we demonstrate, through simulations using the R-package CloneRate, that our estimator for the growth rate has a much smaller mean squared error than previous estimates [1, 2, 4] when $n$ is small. \n\n Joint work with Jason Schweinsberg. \n\n \\begin{enumerate} \\item Brian Johnson et al. cloneRate: fast estimation of single-cell clonal dynamics using coalescent theory. In: Bioinformatics 39.9 (2023), btad561. \\item Emily Mitchell et al. Clonal dynamics of haematopoiesis across the human lifespan. In: Nature 606.7913 (2022), pp. 343–350. \\item Tanja Stadler. On incomplete sampling under birth–death models and connections to the sampling-based coalescent. In: Journal of Theoretical Biology 261.1 (2009), pp. 58–66. \\item Nicholas Williams et al. Life histories of myeloproliferative neoplasms inferred from phylogenies. In: Nature 602.7895 (2022), pp. 162–168. \\end{enumerate}",
            "day": "Friday",
            "time": "10:00--10:30"
        },
        {
            "lastname": "Dai Pra",
            "firstname": "Marta",
            "title": "Multi-type logistic branching processes with selection: frequency process and genealogy for large carrying capacities",
            "abstract": "We present a model for growth in a multi-species population. We consider two types evolving as a logistic branching process with mutation, where one of the types has a selective advantage. We first study the frequency of the disadvantageous type and show that, once the population approaches the carrying capacity, its evolution converges to a Gillespie-Wright-Fisher diffusion process. We then study the dynamics backward in time: we fix a time horizon at which the population is at carrying capacity and we study the ancestral relations of a sample of individuals. We prove that, provided that the advantageous and disadvantageous branching measures are ordered, this ancestral line process converges to the moment dual of the limiting diffusion. This talk is based on joint work with Julian Kern.",
            "day": "Wednesday",
            "time": "11:00--11:30"
        },
        {
            "lastname": "Birkner",
            "firstname": "Matthias",
            "title": "Linear expansion speed for non-monotone population models",
            "abstract": "For a spatial stochastic population model, monotonicity is roughly speaking the property that adding individuals to the initial condition stochastically increases the population at any later time. It is a key ingredient in classical proofs of convergence to equilibrium and of linear expansion in time of the population in the survival regime. We develop comparison arguments which allow to adapt these arguments to population models which are non-monotone, for example because of local competition. Our prototypical example is a branching annihilating random walk. \n\n Based on joint work in progress with Alice Callegaro and Ji\\v{r}\\'{i} \\v{C}ern\\'y.",
            "day": "Tuesday",
            "time": "14:00--14:30"
        },
        {
            "lastname": "Wittmann",
            "firstname": "Meike",
            "title": "Incorporating individual trait variation and niche processes into species interaction models",
            "abstract": "In this talk, I will present a general nonlinear averaging framework via which we can incorporate individual trait variation as well as the niche processes of niche conformance (phenotypic plasticity) and niche construction into species interaction models. This can of course be done via individual-based simulations or numerical methods, but we also provide Taylor approximations that provide more intuitive insight. I will also outline how the effects of individual variation and niche processes on species interactions can be estimated from empirical data.",
            "day": "Wednesday",
            "time": "9:30--10:00"
        },
        {
            "lastname": "Buckland",
            "firstname": "Matthew",
            "title": "The on/off Brownian snake",
            "abstract": "We define what we call an on/off Brownian snake. We use this to construct on/off super Brownian motion recently introduced to the literature by Blath and Jacobi and which is a measure-valued branching process with a dormant state and an active state. Our construction mirrors the construction of super Brownian motion from the Brownian snake by Le Gall. We use the on/off Brownian snake to obtain results concerning the support, range, and expected total mass of on/off super Brownian motion.",
            "day": "Tuesday",
            "time": "16:30--17:00"
        },
        {
            "lastname": "Foutel-Rodier",
            "firstname": "Félix",
            "title": "Genealogies of interacting branching processes",
            "abstract": "An interacting branching process is a population model in which individuals reproduce independently, but in a way that depends on the current state of the population. This dependence can model a wide range of ecological interactions but at the cost of breaking the branching property. We show that, if the population is started close to a stable equilibrium of the ecological dynamics and if the reproduction law has finite variance, the genealogy of the population at large carrying capacity is Kingman's coalescent. \n\n Although this result is arguably expected, standard backward-in-time ideas are hard to apply because the population size and structure fluctuate around their equilibrium. Instead, we devise new forward-in-time arguments relying on an extension of a spinal result of Bansaye (2024) to $k$-spines. In turn, this so-called many-to-few formula allows us to tackle the convergence of the genealogy via stochastic calculus.",
            "day": "Friday",
            "time": "11:30--12:00"
        },
        {
            "lastname": "Blath",
            "firstname": "Jochen",
            "title": "Emergence of host dormancy in the presence of a persistent virus epidemic",
            "abstract": "We study a minimal stochastic individual-based model for a microbial population challenged by a persistent virus epidemic. We focus on the situation in which the resident microbial host population and the virus population are in stable coexistence upon arrival of a single new “mutant” host individual. We assume that this mutant is capable of switching to a reversible state of dormancy upon contact with virions as a means of avoiding infection by the virus. At the same time, we assume that this new dormancy trait comes with a cost, namely a reduced individual reproduction rate in the active state. We prove that there is a non-trivial range of parameters where the mutants can nevertheless invade the resident population with strictly positive probability in the large population limit.  Given the reduced reproductive rate, such an invasion would be impossible in the absence or the virus epidemic. We explicitly characterize the parameter regime where this emergence of a (costly) host dormancy trait is possible, determine the success probability of a single invader and the typical amount of time it takes the successful mutants to reach a macroscopic population size. We conclude this study by an investigation of the fate of the population after the successful emergence of a dormancy trait. Heuristic arguments and simulations suggest that after successful invasion, either both host types and the virus will reach coexistence, or the mutants will drive the resident hosts to extinction while the virus will stay in the system. This is joint work with Andras Tobias (Budapest).",
            "day": "Tuesday",
            "time": "16:00--16:30"
        },
        {
            "lastname": "Wakolbinger",
            "firstname": "Anton",
            "title": "Muller's ratchet with tournament selection",
            "abstract": "Muller's ratchet, in its prototype version, models a haploid population whose size~$N$ is constant over the generations. Slightly deleterious mutations are acquired along the lineages at a constant rate, and individuals carrying less mutations have a selective advantage. The instances at which the minimal mutational load in the population increases are called {\\em clicks of the ratchet}.  In the classical variant (with {\\em fitness proportionate selection}), an individual's selective advantage is proportional to the difference between the population average and the individual's mutation load, whereas in the ratchet with {\\em  tournament selection}  only the ranks of the  individual mutation loads within the population matter. While it is a notoriously stubborn problem to analyse the click rate for fitness proportionate selection, this turns out to be tractable for tournament selection:   In a parameter regime which leads to ``slow clicking'' we obtain the  asymptotic click rates of the tournament ratchet as $N\\to \\infty$, and analyse the large population asymptotics of the empirical type frequency profile at moderately large times. \n\n The talk is based on joint work with Adri\\'an Gonz\\'alez Casanova, Charline Smadi and Jan Lukas Igelbrink.",
            "day": "Thursday",
            "time": "9:00--9:30"
        },
        {
            "lastname": "Leman",
            "firstname": "Hélène",
            "title": "Trait evolution in a Moran Model: Impact of environment and population structure",
            "abstract": "In this talk, I will introduce a population model based on the Moran model, which includes individual competition, mutation, environmental changes, and spatial structure. We will explore various parameter scalings, first examining a scenario with rare mutations and then a scenario with mutations having minimal effects. In each case, we will consider different rates of environmental changes. Then, for a constant environment, we will investigate the influence of the population's spatial structure. Specifically, if the population is organized into demes, we will analyze the dynamics within a deme when the number of demes is infinite. These different limits yield various forms of canonical equations that we can compare. This is a joint work with A. Lambert, H. Morlon, J. Tchouanti and T. Vo.",
            "day": "Tuesday",
            "time": "14:30--15:00"
        },
        {
            "lastname": "Boenkost",
            "firstname": "Florin",
            "title": "The Impact of Deleterious Mutations on Genealogies",
            "abstract": "Based on simulations, we explore the genealogical structure of a Wright-Fisher model with selection and mutation, where each mutation decreases the fitness of an individual, thus we are dealing with deleterious mutations. Depending on the strength of selection and the mutation rate, we observe different genealogies ranging from Kingman's coalescent on various time scales to multiple-merger genealogies. This transition between neutral genealogies and multiple merger genealogies is well predicted by the rule of thumb for the onset of Muller's ratchet derived in [Etheridge et al., 2012]. For a haploid population Muller's ratchet refers to the fact that the fittest class in the population can get lost due to deleterious mutations fixating in the population. \n\n In the second part of this talk, we briefly discuss a mathematically tractable model based on branching Brownian motion, which turns out to be capable of reproducing some genealogical patterns of the Wright-Fisher. We prove that the genealogy converges to the Brownian coalescent point process, where the time scale can be given as any power $N^c$ with $c \\in (0,1]$. This talk is based on joined work with Ksenia Khudiakova and Julie Tourniaire.",
            "day": "Thursday",
            "time": "9:30--10:00"
        },
        {
            "lastname": "Wenzel",
            "firstname": "Yannic",
            "title": "Geometry and stability of species complexes",
            "abstract": "Species complexes are groups of closely related populations exchanging genes through dispersal. We study the dynamics of the structure of species complexes in a class of metapopulation models where demes can exchange genetic material through migration and diverge through the accumulation of new mutations. Importantly, we model the ecological feedback of differentiation on gene flow by assuming that the success of migrations decreases with genetic distance, through a specific function $h$. We investigate the effects of  metapopulation size on the coherence of species structures, depending on some characteristics of the feedback function $h$. Our results suggest that with larger metapopulation sizes, species form increasingly coherent, transitive, and uniform entities.  We conclude that the initiation of speciation events in large species requires the existence of idiosyncratic geographic or selective restrictions on gene flow.",
            "day": "Wednesday",
            "time": "10:00--10:30"
        },
        {
            "lastname": "Tourniaire",
            "firstname": "Julie",
            "title": "Stochastic neutral fractions and the effective population size",
            "abstract": "Population genetics aims to explain observed genetic diversity through past evolutionary forces. In the neutral setting, i.e., in the absence of natural selection and ecological constraints, diversity arises solely from demographic fluctuations. In this simplified framework, the allelic composition of a population converges, in the large-population limit, to the Wright–Fisher diffusion. \n\n This Wright–Fisher model is a purely genetic model, and a key question is how ecological constraints (such as population structure) may influence genetic composition. In this context, the ‘effective population size’, defined as the size of a Wright–Fisher population experiencing the same level of genetic drift as the population under study, plays a central role. \n\n In this talk, I will introduce a stochastic differential equation with an infinite divisibility property to model the dynamics of general structured populations. This property allows the population to be decomposed into neutral allelic fractions. When demographic fluctuations are small, a fast–slow principle yields a general expression for the effective population size in structured settings. \n\n This is joint work with R. Forien, E. Schertzer, and Z. Talyigas",
            "day": "Thursday",
            "time": "11:30--12:00"
        },
        {
            "lastname": "Das",
            "firstname": "Suman",
            "title": "Fitness landscapes of adaptive polymorphism under resource competition",
            "abstract": "Fitness landscapes map the genotypes of an organism to its fitness, and are useful in describing how epistasis, i.e. interactions among mutational effects, guides evolution. A fitness landscape has an associated fitness graph, where nodes represent genotypes and directed edges represent directions of fitness increase caused by mutations. Fitness graphs contain vital information about the landscape topography; for example, the ruggedness of a landscape can be quantified by enumerating the sinks of the fitness graph (which correspond to local fitness maxima). A limitation of the traditional fitness landscape approach, however, is that organismal fitness is usually taken to be independent of population composition, making it ill-suited to studying the effect of epistasis in certain evolutionary scenarios, such as when density-dependent selection in a population leads to adaptive polymorphism.  \n\n To address this, we introduce an extension of the fitness graph, which we call the set transition graph. A node of this graph represents a population comprising one or more distinct genotypes existing in an ecologically stable state, whereas directed edges represent evolutionary transitions between such populations driven by de novo mutations. A sink in this graph corresponds to an evolutionary equilibrium (i.e., a state that is robust to mutations arising in the population) and is a generalization of the concept of a local fitness maximum. We apply this framework to a model of competition for two resources and study the system in the tractable limit of highly epistatic genotype-phenotype maps. We find that the set transition graphs for this system are topographically smoother than their traditional counterparts, and polymorphic evolutionary equilibria (composed of multiple genotypically distinct subpopulations) vastly outnumber monomorphic ones. Notably, the topology of the set transition graph depends sensitively on the tails of the phenotype distributions, giving rise to multiple universality classes of landscape ruggedness based on the heaviness of the tail. \n\n In summary, our work combines interactions at the genetic and organismal levels into a single evolutionary landscape that displays a complex relationship between epistasis and landscape topography, distinct from its analogues in classical fitness landscapes. ",
            "day": "Thursday",
            "time": "16:30--17:00"
        },
        {
            "lastname": "Schertzer",
            "firstname": "Emmanuel",
            "title": "Selection of the fittest or selection of the luckiest",
            "abstract": "Biological evolution depends on the passing down to subsequent generations of genetic information encoding beneficial traits, and on the removal of unfit individuals by a selection mechanism. However, selection acts on phenotypes, and is affected by random contingencies. Thus, a combination of fitness and luck determines which individuals will successfully reproduce and give rise to the next generation. To understand how randomness in the selection mechanism affects the long-term patterns of evolution, we studied an idealized evolution model. We show through simulations and mathematical analysis, that the speed of adaptation increases with increasing selection pressure only up to a threshold. Beyond the threshold, any increase of the selection pressure results in more weight given to random effects rather than on genetic fitness in determining which individuals will successfully reproduce. This severely reduces the speed of adaptation and the diversity in the gene pool. Our findings may be considered as a biological instance of  Goodhart's law: {\\em When a measure becomes a target, it ceases to be a good measure}. Finally, we show that this intricate response of evolution to natural selection can be mathematically explained by a novel phase transition for pulled traveling waves.",
            "day": "Wednesday",
            "time": "11:30--12:00"
        },
        {
            "lastname": "Freund",
            "firstname": "Fabian",
            "title": "Can gene duplications get out of hand? A simple model to explain the occurrence of high duplication counts in gene families?",
            "abstract": "Gene families in various species may show tens to hundreds of copies, with no strong indication of these copies all being functional relevant. We introduce a simple Muller's ratchet inspired model for the interplay between selection and gene duplication and analyse its behaviour with and without genetic drift. We then assess the fit and implications of our models for gene families sequenced in zebrafish and humans. Joint work with Johannes Wirtz, Yichen Zheng, Yannick Schäfer, and Thomas Wiehe.",
            "day": "Thursday",
            "time": "11:00--11:30"
        },
        {
            "lastname": "Traulsen",
            "firstname": "Arne",
            "title": "Rethinking the connection between Theoretical Ecology and Evolutionary Game Theory",
            "abstract": "Evolutionary game theory is a popular approach to analyze interactions within or between different types in biology, starting with the explanation of limited war strategies in animal conflict. The most popular model to study well-mixed populations is the replicator dynamics. Josef Hofbauer and Karl Sigmund have shown that the replicator dynamics for n types is equivalent to a Lotka-Volterra system for n-1 types, i.e. one type less. Only if the growth rates in isolation are identical, such a change in the number of types is not necessary. Not taking into account this complication can lead to issues for applications of EGT to empirical systems and one needs to be very careful in translating between ecological models and game theoretical ones. For example, ecologists who describe their studies as cooperation may in fact work on mutualisms or coexistence games. \n\n Tarnita and Traulsen, Reconciling ecology and evolutionary game theory or {\\em When not to think cooperation} PNAS (2025)",
            "day": "Wednesday",
            "time": "9:00--9:30"
        },
        {
            "lastname": "Cordero",
            "firstname": "Fernando",
            "title": "Speciation induced by dormancy in a model with changing environment",
            "abstract": "We consider a population model in which the season alternates between winter and summer. Individuals can acquire mutations that are advantageous in the summer but disadvantageous in the winter, or vice versa.  Furthermore, it is assumed that individuals within the population can either be active or dormant, and that individuals can transition between these two states.  Dormant individuals do not reproduce and are not subject to selective pressures. Our findings indicate that, under some conditions, two waves of adaptation emerge over time. Some individuals repeatedly acquire mutations that are beneficial in the summer, while others repeatedly acquire mutations that are beneficial in the winter. Individuals can survive the season during which they are less fit by entering a dormant state. This result demonstrates that, for populations in fluctuating environments, dormancy has the potential to induce speciation. \n\n This is joint work with Adrián González Casanova and Jason Schweinsberg.",
            "day": "Tuesday",
            "time": "17:00--17:30"
        },
        {
            "lastname": "Ortgiese",
            "firstname": "Marcel",
            "title": "The spatial Muller's ratchet",
            "abstract": "In this talk we will consider the spatial Muller's ratchet introduced by Foutel-Rodier and Etheridge (2020). This particle system represents a spatial model of an asexual population with birth and death rates that depend on the local population density. For each particle, we keep track of the number of mutations of its genotype. Moreover, at each birth event with positive probability the offspring receives an additional mutation resulting in a lower birth rate. We show that under appropriate re-scaling, the process converges weakly to an infinite system of PDEs, confirming non-rigorous computations of Foutel-Rodier and Etheridge. Under certain conditions, we can analyse these PDEs and consider the behaviour of travelling waves exploring an empty habitat. Finally, we will also answer the question whether deleterious mutations can surf population waves. Throughout we will discuss some of the technical difficulties that arise when dealing with a non-monotone particle systems with infinitely many types and long-range interactions. \n\n This is joint work with Joao de Oliveira Madeira and Sarah Penington.",
            "day": "Thursday",
            "time": "10:00--10:30"
        },
        {
            "lastname": "Hummel",
            "firstname": "Sebastian",
            "title": "Multi-Type Birth-Death Processes with Mean-Field Interactions for B-cell Phylodynamics",
            "abstract": "Antibody binding affinity maturation is a crucial process of the adaptive immune system. Motivated to model this process, we formulate a system of multi-type birth-death processes that can interact through their empirical distribution. We show that the empirical distribution process of the system of birth-death processes converges to a deterministic probability measure-valued flow as the system size tends to infinity. In this limit, a focal process evolves as a multi-type birth-death process with rates governed by the probability measure-valued flow, which is, in turn, the flow of the one-dimensional marginal distribution of the focal process. Individual processes become independent in the limit, which suggests inference to be feasible for this model. \n\n This is joint work with William S. DeWitt, Steven Evans, and Ella Hiesmayr.",
            "day": "Friday",
            "time": "11:00--11:30"
        },
        {
            "lastname": "Gonzalez Casanova",
            "firstname": "Adrian",
            "title": "Dice Processes",
            "abstract": "We introduce the dice process, a probabilistic model that describes the evolution of a collection of particles moving over a graph according to random local rules. At each time step, all particles occupying the same site use a common, randomly chosen “dice” to determine their next move. This construction gives rise to a rich class of (partially) exchangeable Markov chains. \n\n The main result of the talk establishes that every partially exchangeable collection of Markov chains on a finite state space can be represented as a dice process. As an application, we obtain a natural characterization of multitype $\\Lambda$-coalescents without restrictions on the migration mechanism. \n\n We will also briefly discuss a related detour involving the evolutionary rate of plasmid-bearing bacteria. This part of the talk is based on recent experimental work by Paula Ramiro-Martínez, Ignacio de Quinto, Laura Jaraba-Soto, Val F. Lanza, Cristina Herencias-Rodríguez, Rafael Peña-Miller, and Jerónimo Rodríguez-Beltrán. \n\n The main results are drawn from the PhD thesis of Imanol Nuñez (soon to be on the postdoc job market), in collaboration with Noemi Kurt and José Luis Pérez.",
            "day": "Thursday",
            "time": "16:00--16:30"
        },
        {
            "lastname": "Uecker",
            "firstname": "Hildegard",
            "title": "How does mate limitation affect evolutionary rescue for different sexual systems?",
            "abstract": "Environmental change may lead to drastic declines in the population size and drive populations towards extinction. For populations with biparental sexual reproduction, the decline in the population density may entail another risk in addition to the external stress: a reduced probability to find a mate. Nevertheless, most models of evolutionary rescue assume that mating is assured even at small population sizes. In this talk, I present results from models for rescue under mate limitation. We consider populations with three different sexual systems which differ in their reproductive pools and mate pools and thus in the intrinsic extent of mate limitation: dioecious, hermaphroditic, and androdioecious populations. Very simple mathematical arguments allow us to both explain and predict results from stochastic computer simulations such as shifts in the optimal sex ratio in dioecious populations with increasing mate limitation. Overall, our results demonstrate the need to account both for the specificities of the sexual system and for the density dependence of mate finding for the assessment of a population's scope for evolutionary rescue. At the end of the talk, I will discuss two open questions for research in mathematics and biology and briefly introduce a host-parasitoid system of crickets and flies, where mate limitation may or may not contribute to the empirically observed dynamics. \n\n\n This is joint work with Puneeth Deraje.",
            "day": "Friday",
            "time": "9:00--9:30"
        },
        {
            "lastname": "Viet Tran",
            "firstname": "Chi",
            "title": "From stochastic individual-based models to Hamilton-Jacobi PDEs",
            "abstract": "We study the evolution of a population with a phenotypic trait structure, where the dynamics is ruled by births, deaths and mutations. We are interested in following populations in logarithmic scales of size and time, and derive a limiting Hamilton-Jacobi equation (with state constraints) from the stochastic individual based model. The limiting partial differential equation takes into account possible extinction events of the system on certain regions of the trait space. The proof emphasizes the links with the theory of large deviations.",
            "day": "Thursday",
            "time": "14:00--14:30"
        },
        {
            "lastname": "Brouard",
            "firstname": "Vianney",
            "title": "Extended power-law mutation regime in adaptive dynamics",
            "abstract": "This talk is based on a work in progress with Charline Smadi. We consider a stochastic individual-based model in the adaptive dynamics framework, in which the evolution of the population is driven by births, deaths, competition, and mutations along the edges of a graph. We focus on the case where the space of possible traits is given by $\\mathbb{Z}^d$, and we study a new mutation regime that generalises the classical power-law mutation rate regime. We refer to this as the extended power-law regime. \n\n\n More precisely, we consider the large-population limit under a mutation rate $\\mu_K$ given by $\\mu_K = K^{-1/\\alpha_K}$, where $K$ is the carrying capacity of the system, and $\\alpha_K \\to \\infty$ subject to certain upper bound conditions on its growth. In this regime, an asymptotically infinite number of mutant traits coexist at the same time, competing to invade the resident population. \n\n\n We describe the time evolution of the orders of magnitude (also known as the stochastic exponents) of each subpopulation on the $\\ln K/\\alpha_K$ time scale, as $K \\to \\infty$. Extending the techniques developed in Champagnat, Méléard, and Tran (2021) to our setting, we show that these trajectories are piecewise affine and continuous, with slopes determined by an algorithm that captures the changes in the fitness landscape induced by the succession of new resident or emergent traits.",
            "day": "Thursday",
            "time": "15:00--15:30"
        },
        {
            "lastname": "Baumdicker",
            "firstname": "Franz",
            "title": "On the number and weight of bacterial ancestors in a biparental Moran model",
            "abstract": "In classical biparental Moran-type models, each parent contributes equally to the genetic makeup of their offspring. Coron and Le Jan (2006) analysed such a system and characterised the limiting distribution of an ancestor’s genetic contribution. One key result in this model is that the genetic contribution of all ancestors in the past is small and asymptotically independent. In this talk, I present an extension of their framework that introduces a parental bias parameter p, allowing asymmetric inheritance. This parameter can be interpreted biologically in two ways: as unequal parental genomic contributions in sexual reproduction, or as a transfer probability modeling bacterial populations where most genes are inherited from a “mother” cell, with a smaller fraction acquired via horizontal gene transfer. We consider the limiting distribution of ancestral contributions under this generalised model. For constant p, the asymptotic behaviour closely mirrors the original results. However, when p is rescaled with population size, qualitatively different patterns emerge. Revealing a new regime where the genetic weight of ancestors is neither small nor independent.",
            "day": "Friday",
            "time": "9:30--10:00"
        },
        {
            "lastname": "Louvet",
            "firstname": "Apolline",
            "title": "Stochastic modelling of population dynamics in a spatial continuum and application to epidemiology",
            "abstract": "Spatial Lambda-Fleming-Viot processes, or SLFVs, are a family of stochastic processes that have been developed to overcome some issues arising when defining stochastic population dynamics models in a spatial continuum of arbitrary dimension. Their main characteristic is their {\\em reproduction event-driven} dynamics that controls local reproduction rates and ensures the existence of a dual process, which is a key tool to the analysis of SLFV processes. In this talk, after giving an overview of this modelling framework, I will present a recent extension to the modelling of epidemics, giving rise to a stochastic SIS-type model in continuous space. I will show to what extent the central concept of basic reproduction number can be extended to this model, using the duality relation along with the characterization of the process as the unique solution to a martingale problem. \n \n Based on a joint work with Bastian Wiederhold (LMU).",
            "day": "Tuesday",
            "time": "15:00--15:30"
        },
        {
            "lastname": "Esser",
            "firstname": "Manuel",
            "title": "How pit stops accelerate the crossing of fitness valleys",
            "abstract": "We consider a stochastic individual-based model of adaptive dynamics for an asexually reproducing population with mutation. To depict repeating changes of the environment, all of the model parameters vary over time as piecewise constant and periodic functions, on an intermediate time scale between those of stabilization of the resident population (fast) and exponential growth of mutants (slow). This can biologically interpreted as the influence of seasons or the variation of drug concentration during medical treatment. The typical evolutionary behaviour can be studied by looking at limits of large populations and rare mutations. \n\n Focussing on the situation of large fitness valleys we first determine the effective crossing rate as particular average of the rates for constant environments. Eventually, we investigate the special situation of pit stops, where single intermediate mutants within the valley have phases of positive fitness and can thus grow to a diverging size before dying out again. This significantly accellerates the traversal of the valley and leads to a interesting new time scale. \n\n This is joint work with Anna Kraut.",
            "day": "Thursday",
            "time": "14:30--15:00"
        }
    ],
    "posters": [
        {
            "lastname": "Nava Trejo",
            "firstname": "Julio Ernesto",
            "title": "tba",
            "abstract": "tba"
        },
        {
            "lastname": "Franck",
            "firstname": "Sascha",
            "title": "tba",
            "abstract": "tba"
        },
        {
            "lastname": "Adeosun",
            "firstname": "Samuel",
            "title": "A stochastic model for biased inheritance of transposable elements in diploid populations",
            "abstract": "In this study, we extend existing diploid population model in [1] by introducing a selection parameter $\\varepsilon_N$ , allowing for a bias in transmission probabilities of transposable elements (TEs) from parents to offsprings. Our analysis employs a biparental Moran model to investigate how this bias influences the TE distribution across generations and the limiting dynamics as population size $N$ approaches infinity. Using the martingale problem approach, we conjecture that in the large-population limit, the mean TE count follows a non-critical Feller branching diffusion, while the population distribution remains Poisson. Additionally, we apply our model to genomic data from the African termite (Macrotermes bellicosus), anticipating that ongoing analyses will uncover detectable TE variation among individuals, thereby providing insights into biased inheritance in natural populations. \n\n [1] Pfaffelhuber, P. and Wakolbinger, A. (2023). A diploid population model for copy number variation of genetic elements. Electronic Journal of Probability, 28, 1--15."
        },
        {
            "lastname": "Bauer",
            "firstname": "Johann",
            "title": "Mutation-bias learning -- an evolutionary game dynamics approach to convergence analysis in multi-agent reinforcement learning",
            "abstract": "We pursue a mathematically rigorous approach connecting stochastic multi-agent reinforcement learning (MARL) processes to deterministic dynamical systems of replicator-mutator dynamics (RMD) type from evolutionary game theory (EGT). This dynamical systems perspective makes the rich literature on EGT dynamics directly available for establishing theoretical guarantees for algorithm convergence in complex multi-agent environments, addressing a fundamental challenge in the field. \n\n We demonstrate our approach by presenting and analysing MBL-DPU, a MARL algorithm for which we prove that it approximates RMD and converges in stable games. We illustrate the utility of our dynamical systems analysis experimentally across games of increasing complexity and dimensionality in comparison to similar MARL algorithms with fewer theoretical guarantees, WoLF-PHC and FAQ-learning, which deteriorate unexpectedly in higher dimensions. \n\n Beyond specific algorithms, the approach demonstrates a principled route to transferring results from EGT to multi-agent learning, allowing a systematic comparison of evolutionary game dynamics with MARL algorithms and enabling the derivation of further MARL algorithms from evolutionary dynamics."
        },
        {
            "lastname": "Singh",
            "firstname": "Akanksha",
            "title": "Fixation probability of a mutant in spatially structured populations",
            "abstract": "Natural populations are often interconnected through migration, resulting in a metapopulation. We study how the fixation probability of a mutant depends on the migration network, across all possible metapopulation networks with four demes. We use a stochastic birth-death process that allows for some compensation of change in deme sizes due to migration. Taking the limit of rare migration, we derive the analytical expressions of fixation probability for symmetric and asymmetric migration on these networks. For symmetric migration, our results are consistent with those of Maruyama (1974) and Marrec et al (2021), in showing that population structure does not affect the fixation probability of a mutant. \n\n In contrast, asymmetric migration networks modify the fixation probabilities on different network structures differently. In degree homogeneous metapopulation networks, asymmetric migration networks typically ($>90$\\%) improve the chances of fixation of deleterious mutants, while curbing those of beneficial mutants as compared to symmetric migration; an effect that has been called suppression of selection in evolutionary graph theory (Lieberman et al (2005)). However, degree inhomogeneous metapopulation networks also show another prominent modification of fixation probabilities: reducing the chances of small deleterious mutants fixing in the population while improving those of small beneficial mutants, i.e., amplify selection (Lieberman et al (2005)) near the neutral mutant. Looking at specific migration networks, we find that amplification of selection occurs when migration is biased towards the higher degree demes of the network, making them act as hubs. Through this study, we aim to suggest migration patterns could have desired effects in conservation efforts and in experimental setups."
        },
        {
            "lastname": "Njiasse",
            "firstname": "Ibrahim",
            "title": "tba",
            "abstract": "tba"
        },
        {
            "lastname": "Relekar",
            "firstname": "Chandan",
            "title": "Inference of Interactions in the Gut Microbiome",
            "abstract": "The role of the gut microbiome in myriad aspects of physical and mental well-being is being increasingly implicated by a stream of studies that identify correlations of gut microbiome compositions with certain diseases and disorders. However, inferring the nature and strength of interactions in the gut microbiome appears to be elusive due to the high number of species present, the low time resolution of empirical data, and the non-linear or higher-order interactions probably present. Our approach is to extract more information from the higher-order moments which additionally allows us to fit noise/variance in the data to what is expected from demographic stochasticity in the underlying model. We have incorporated this {\\em improvement} into generic methods of parameter inference. We are trying to observe if this improvement enables more precise time-series prediction and more accurate parameter inference."
        },
        {
            "lastname": "Spigno",
            "firstname": "Sabrina",
            "title": "The effect of autotoxicity on the temporal dynamics of microbial communities",
            "abstract": "Gut microbiota population dynamics has widely been described with Generalized Lotka-Volterra (gLV) models (Joseph et al., 2020, Li et al., 2021). While gLV models capture broad dynamical regimes, they fail to incorporate biologically relevant mechanisms such as chemical self-inhibition. Here, we propose an alternative framework based on self-inhibition driven by the accumulation of autotoxic compounds, such as extracellular DNA (Mazzoleni et al., 2015a). Using methods inspired by established techniques used for gLV, we theoretically analyze this general model, aiming to isolate the role of autotoxicity. Numerical simulations across single-species and large-community systems show that autotoxicity alters the dynamics. At small scales, autotoxicity modulates oscillation amplitude and frequency. In large communities, our analysis reveals that increasing the autotoxicity can sustain species coexistence while diluting it allow dominant species to exclude others. To qualitatively support the biological relevance of these theoretical regimes, we analyzed gut microbiota metagenomic data across diverse conditions, finding that rare species are most sensitive to environmental shifts, while certain unhealthy states are marked by the dominance of a single species.\n\n \\begin{enumerate} \\item T. A. Joseph, L. Shenhav, J. B. Xavier, E. Halperin, and I. Peer, Compositional Lotka-Volterra describes microbial dynamics in the simplex, (in English), Plos Computational Biology, Article vol. 16, no. 5, p. 22, May 2020, Art no. e1007917, doi: 10.1371/journal.pcbi.1007917. \n \\item Jie Li, Xuzhu Shen, YaoTang Li, “Modeling the temporal dynamics of gut microbiota from a local community perspective”, Ecological Modelling, Volume 460, 2021,            109733, ISSN 0304-3800, https: //doi.org/10.1016/j.ecolmodel.2021.109733. \n \\item Mazzoleni, S., Landi, C., Cartenì, F., de Alteriis, E., Giannino, F., Paciello, L., Parascandola, P.,             2015a. A novel process-based model of microbial growth: self-inhibition in Saccharomyces cerevisiae aerobic fed-batch cultures. Microbial Cell Factories 14, 109-109, doi: 10.1186/s12934-015-0295-4. \\end{enumerate}"
        },
        {
            "lastname": "Brhane",
            "firstname": "Kewani Welay",
            "title": "tba",
            "abstract": "tba"
        },
        {
            "lastname": "Zass",
            "firstname": "Alexander",
            "title": "Modelling colloidal suspensions with probabilistic tools",
            "abstract": "In this work, we consider a dynamical version of the Asakura--Oosawa model of interacting hard spheres of two different sizes. We study their random diffusion dynamics, modelled with collision local times; describe the reversible measures; and observe the emergence of an attractive short-range depletion interaction between the large spheres. We also study the Gibbs measures associated to this new interaction, exploring connections to percolation and optimal packing. This is \\href{https://arxiv.org/abs/2502.15628}{joint work with Myriam Fradon}."
        }
    ]
}